Imports System.Collections.ObjectModel

Public Class Glyphs
    Inherits ObservableCollection(Of String)

    Public Sub New()
        Dim glyphlist As New List(Of String) From
            {"A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z",
             "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z",
             "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "!", "?", ".", ",",
             "À", "Á", "Â", "Ã", "Ä", "Å", "Æ", "Ç", "È", "É", "Ê", "Ë", "Ì", "Í", "Î", "Ï", "Ñ", "Ò", "Ó", "Ô", "Õ", "Ö", "Ù", "Ú", "Û", "Ü",
             "ß", "à", "á", "â", "ã", "ä", "å", "æ", "ç", "è", "é", "ê", "ë", "ì", "í", "î", "ï", "ñ", "ò", "ó", "ô", "õ", "ö", "ù", "ú", "û",
             "ü", """", "%", "&", "'", "(", ")", "*", "+", "-", "/", ":", ";", "=",
             "<", ">", "@", "#", "$", "[", "\", "]", "^", "_", "{", "|", "}", "~", "¡", "¢", "£", "¥", "×", "¦", "÷", "©", "«", "¬", "®", "°",
             "±", "¹", "²", "³", "µ", "»", "¼", "½", "¾", "¿", "α", "β", "γ", "δ", "ε", "ζ", "η", "θ", "ι", "κ", "λ", "μ", "ν", "ξ", "ο", "π",
             "ρ", "σ", "τ", "υ", "φ", "χ", "ψ", "ω", "Ø", "Ý", "ð", "ø", "ý", "ÿ"}

        For Each i In glyphlist
            Add(i)
        Next

    End Sub

End Class
